Mahantesh/BomAutoTestnew/target/classes/sikorderid.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://comcastonline.com/">
 <soapenv:Header>
  <com:requestHeader>
   <com:timestamp>2010-03-24T14:21:02Z</com:timestamp>
   <com:sourceSystemId>esp-sikoms-2010</com:sourceSystemId>
   <com:sourceSystemUserId>tester</com:sourceSystemUserId>
   <com:sourceServerId>1</com:sourceServerId>
   <com:trackingId>1</com:trackingId>
  </com:requestHeader>
  <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" soapenv:mustUnderstand="1">
   <wsse:UsernameToken>
    <wsse:Username>QA</wsse:Username>
    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">qapw001</wsse:Password>
   </wsse:UsernameToken>
  </wsse:Security>
 </soapenv:Header>
 <soapenv:Body>
  <com:OrderSearch>
   <com:Request>
    <com:AccountNumber>&AccountNumber</com:AccountNumber>
    <com:WorkOrderID>&omsWrkOrdrId</com:WorkOrderID>
   </com:Request>
  </com:OrderSearch>
 </soapenv:Body>
</soapenv:Envelope>